Some values in the the FlightNumber column are missing. These numbers are
meant to increase by 10 with each row so 10055 and 10075 need to be put in
place. Fill in these missing numbers and make the column an integer column
(instead of a float column).

In [42]:
import pandas as pd
import numpy as np
df=pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN',
'londON_StockhOlm',

'Budapest_PaRis', 'Brussels_londOn'],
'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )',
'12. Air France', '"Swiss Air"']})

In [43]:
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN           NaN            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis           NaN          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

In [44]:
df.loc[0,'FlightNumber']

10045.0

In [48]:
index=np.arange(1,df.FlightNumber.count()+1)
df.set_index(index,inplace=True)
df

            From_To  FlightNumber  RecentDelays              Airline
1      LoNDon_paris       10045.0      [23, 47]               KLM(!)
2      MAdrid_miLAN       10055.0            []    <Air France> (12)
3  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
4    Budapest_PaRis       10075.0          [13]       12. Air France
5   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

In [49]:
for i in range(1, df['FlightNumber'].count() + 1):
      if pd.isnull(df.loc[i,'FlightNumber']):
            df.loc[i, 'FlightNumber'] = df.loc[i-1, 'FlightNumber'] + 10
df

            From_To  FlightNumber  RecentDelays              Airline
1      LoNDon_paris       10045.0      [23, 47]               KLM(!)
2      MAdrid_miLAN       10055.0            []    <Air France> (12)
3  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
4    Budapest_PaRis       10075.0          [13]       12. Air France
5   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

In [50]:
df['FlightNumber'].astype(int)

1    10045
2    10055
3    10065
4    10075
5    10085
Name: FlightNumber, dtype: int32

The From_To column would be better as two separate columns! Split each
string on the underscore delimiter _ to give a new temporary DataFrame with
the correct values. Assign the correct column names to this temporary
DataFrame.

In [51]:
df[['From','To']]= df.From_To.str.split(pat="_",expand=True)

Notice how the capitalisation of the city names is all mixed up in this
temporary DataFrame. Standardise the strings so that only the first letter is
uppercase (e.g. "londON" should become "London".)

In [52]:
df['From']=df['From'].str.capitalize()
df['To']=df['To'].str.capitalize()

In [53]:
df

,From_To,FlightNumber,RecentDelays,Airline,From,To
1,LoNDon_paris,10045.0,"[23, 47]",KLM(!),London,Paris
2,MAdrid_miLAN,10055.0,[],<Air France> (12),Madrid,Milan
3,londON_StockhOlm,10065.0,"[24, 43, 87]",(British Airways. ),London,Stockholm
4,Budapest_PaRis,10075.0,[13],12. Air France,Budapest,Paris
5,Brussels_londOn,10085.0,"[67, 32]","""Swiss Air""",Brussels,London

Delete the From_To column from df and attach the temporary DataFrame
from the previous questions.

In [54]:
df=df.drop("From_To",axis=1)
df

   FlightNumber  RecentDelays              Airline      From         To
1       10045.0      [23, 47]               KLM(!)    London      Paris
2       10055.0            []    <Air France> (12)    Madrid      Milan
3       10065.0  [24, 43, 87]  (British Airways. )    London  Stockholm
4       10075.0          [13]       12. Air France  Budapest      Paris
5       10085.0      [67, 32]          "Swiss Air"  Brussels     London

In the RecentDelays column, the values have been entered into the
DataFrame as a list. We would like each first value in its own column, each
second value in its own column, and so on. If there isn't an Nth value, the value
should be NaN.
Expand the Series of lists into a DataFrame named delays, rename the columns
delay_1, delay_2, etc. and replace the unwanted RecentDelays column in df
with delays.

In [55]:
df['RecentDelays']

1        [23, 47]
2              []
3    [24, 43, 87]
4            [13]
5        [67, 32]
Name: RecentDelays, dtype: object

In [56]:
df2 = (pd.DataFrame(df['RecentDelays'].values.tolist(), index=df.index)

        .rename(columns = lambda x: 'Delay{}'.format(x+1)))

In [62]:
df3=df.join(df2)
df3

,FlightNumber,RecentDelays,Airline,From,To,Delay1,Delay2,Delay3
1,10045.0,"[23, 47]",KLM(!),London,Paris,23.0,47.0,NaN
2,10055.0,[],<Air France> (12),Madrid,Milan,NaN,NaN,NaN
3,10065.0,"[24, 43, 87]",(British Airways. ),London,Stockholm,24.0,43.0,87.0
4,10075.0,[13],12. Air France,Budapest,Paris,13.0,NaN,NaN
5,10085.0,"[67, 32]","""Swiss Air""",Brussels,London,67.0,32.0,NaN

In [67]:
df4=df3.replace(to_replace='RecentDelays',value='Delays')

In [68]:
df4

,FlightNumber,Airline,From,To,Delay1,Delay2,Delay3
1,10045.0,KLM(!),London,Paris,23.0,47.0,NaN
2,10055.0,<Air France> (12),Madrid,Milan,NaN,NaN,NaN
3,10065.0,(British Airways. ),London,Stockholm,24.0,43.0,87.0
4,10075.0,12. Air France,Budapest,Paris,13.0,NaN,NaN
5,10085.0,"""Swiss Air""",Brussels,London,67.0,32.0,NaN